### python基础
复习
最基础的数据结构开始：元组、列表、字典和集合。然后会讨论创建你自己的、可重复使用的Python函数。最后，会学习Python的文件对象，以及如何与本地硬盘交互。

In [1]:
tup = 4,5,6
print(tup)

(4, 5, 6)

运行上面的代码可以看出创建是一个是用逗号分隔一列值，即元组
元组是一个固定长度，不可改变的Python序列对象

In [2]:
tup1 = (1,2,3),(4,5,)
print(tup1)

((1, 2, 3), (4, 5))

当用复杂的表达式定义元组，最好将值放到圆括号内

用tuple可以将任意序列或迭代器转换成元组：

In [3]:
tup2 = tuple([1,2,3])
print(tup2)
tup3 = tuple("hello")
print(tup3)

(1, 2, 3)
('h', 'e', 'l', 'l', 'o')

类似数组，从0开始访问
元组中存储的对象可能是可变对象。一旦创建了元组，元组中的对象就不能修改了

In [4]:
print(tup3[0])

h

In [5]:
tup4= (1,(2,3,),[4,5,6],"hello")
print(tup4)
tup4[2].append(7)
print(tup4)

(1, (2, 3), [4, 5, 6], 'hello')
(1, (2, 3), [4, 5, 6, 7], 'hello')

元组可以存储多个类型不同的数据，如果数据可变，可在相应的位置
执行append操作

可以利用+执行连接操作

In [6]:
tup1+tup4

((1, 2, 3), (4, 5), 1, (2, 3), [4, 5, 6, 7], 'hello')

利用\* 可以执行复制操作

In [7]:
tup1*2

((1, 2, 3), (4, 5), (1, 2, 3), (4, 5))

拆分元组

In [8]:
a,b= tup1
print(a,b)
a1,a2,a3= a
print(a1)

(1, 2, 3) (4, 5)
1

In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([1,2,34,5],index=[1,2,3,4])
print(obj)

1     1
2     2
3    34
4     5
dtype: int64

In [8]:
obj[1]

False

In [11]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
       'info':[1,2,3,4,5,6]}
frame = pd.DataFrame(data)
print(data)
print(frame)

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2], 'info': [1, 2, 3, 4, 5, 6]}
   info  pop   state  year
0     1  1.5    Ohio  2000
1     2  1.7    Ohio  2001
2     3  3.6    Ohio  2002
3     4  2.4  Nevada  2001
4     5  2.9  Nevada  2002
5     6  3.2  Nevada  2003

In [15]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [18]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [21]:
del frame['info']

In [22]:
print(frame)

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [24]:
list(frame.columns)

['pop', 'state', 'year']

In [37]:
pop = {
    'Nevada': {2000:2.5,2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6
            }
    }

In [38]:
frame2 = pd.DataFrame(pop)
print(frame2)
print(frame2.T)

      Nevada  Ohio
2000     2.5   1.5
2001     2.4   1.7
2002     2.9   3.6
        2000  2001  2002
Nevada   2.5   2.4   2.9
Ohio     1.5   1.7   3.6

In [30]:
frame2.index.name='year'
frame2.columns.name='starte'
print(frame2)

starte  Nevada  Ohio
year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [31]:
frame2.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [32]:
2002 in frame2.index

True

In [36]:
'Nevada' in frame2.columns

True

In [41]:
se1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
se1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [42]:
se1.reindex(['a','b','c','d','e','f'])

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
dtype: float64

使用ffill可以实现前向值填充：

In [44]:
se2 = pd.Series(['red','blue','yellow'],index=[0,2,4])
se2

0       red
2      blue
4    yellow
dtype: object

In [45]:
se2.reindex(range(6),method='ffill')

0       red
1       red
2      blue
3      blue
4    yellow
5    yellow
dtype: object

丢弃某条轴上的一个或多个项很简单，只要有一个索引数组或列表即可。由于需要执行一些数据整理和集合逻辑，所以drop方法返回的是一个在指定轴上删除了指定值的新对象：

In [46]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [48]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

删除多个数据

In [50]:
obj2 = obj.drop(['a','b'])
obj2

c    2.0
d    3.0
e    4.0
dtype: float64

对于DataFrame，可以删除任意轴上的索引值。

In [55]:
data = pd.DataFrame(np.arange(1,17).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        1    2      3     4
Colorado    5    6      7     8
Utah        9   10     11    12
New York   13   14     15    16

In [56]:
 data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        9   10     11    12
New York   13   14     15    16

In [57]:
data.drop('two',axis=1)

          one  three  four
Ohio        1      3     4
Colorado    5      7     8
Utah        9     11    12
New York   13     15    16

In [1]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

除其空值null和一些其他的细微差别（如列表末尾不允许存在多余的逗号）之外，JSON非常接近于有效的Python代码。基本类型有对象（字典）、数组（列表）、字符串、数值、布尔值以及null。对象中所有的键都必须是字符串。许多Python库都可以读写JSON数据。我将使用json，因为它是构建于Python标准库中的。通过json.loads即可将JSON字符串转换成Python形式：

作者：SeanCheney
链接：https://www.jianshu.com/p/047d8c1c7e14
來源：简书
著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。

In [3]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [4]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [10]:
import pandas as pd
siblings = pd.DataFrame(result["siblings"])
siblings

   age   name                    pets
0   30  Scott            [Zeus, Zuko]
1   38  Katie  [Sixes, Stache, Cisco]